---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.DeleteRule(Autodesk.Revit.DB.PerformanceAdviserRuleId)
source: html/5ee4078a-7f2f-b7f1-f75c-52398c891d42.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.DeleteRule Method

Deletes a performance adviser rule from the list of rules.

## Syntax (C#)
```csharp
public void DeleteRule(
	PerformanceAdviserRuleId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - An id of the rule to be deleted from the list of rules.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null